In [81]:
import pandas as pd

In [ ]:
mre_2010 = [216485, 214346, 234940, 232737, 241339, 461253, 1139837, 474552, 276371, 252161, 322419, 311463]
mre_2011 = [238691, 215674, 241264, 283161, 262433, 516809, 1068449, 401943, 289568, 294302, 287262, 308694]
mre_2012 = [227783, 230028, 235426, 296495, 249701, 487026, 811865, 659373, 285529, 355935, 214977, 309289]
mre_2013 = [240686, 210732, 246794, 287268, 270655, 439863,814978, 987485, 301238, 359073, 230610, 333549]
mre_2014 = [248723, 229398, 255671, 301739, 279261, 414124,997612, 905769, 326470, 311458, 239901, 335365] 
mre_2015 = [275000, 244977, 275502, 299405, 297394, 395335,1198637, 797515, 393836, 267264, 242645, 337548]  
mre_2016 = [273896, 259858, 293742, 312553, 298985, 379106,1308736, 809092, 402233, 286350, 241550, 362426]  # Jan→Déc
mre_2017 = [293097, 270639, 286466, 342106, 295680, 390860,1342234, 1031881, 309671, 288937, 260837, 372019]  # Jan→Déc
mre_2018 = [302999, 265455, 301070, 334862, 269729, 429914,1287368, 1146142, 316264, 297479, 276296, 382029]  # Jan→Déc
mre_2019 = [312835, 284190, 312842, 388604, 249014, 492341,1410644, 1059321, 347983, 314861, 297242, 419377]  # Jan→Déc
mre_2021 = [141327, 89018, 79401, 15995, 19013, 239980,712576, 469074, 195222, 261324, 204872, 9565]  # Jan→Déc
mre_2022 = [8131, 201221, 291852, 243339, 364763, 623431,1401567, 804583, 421665, 481796, 403395, 558340]  # Jan→Déc
mre_2023=[454921,431759,452682,461646,495899,769109,1378778,878037,463775,499229,450423,638475]
mre_2024=[498333, 505266, 466481, 554558, 564022, 820357, 1695181, 987216, 581667, 627666, 559671, 753742]
mre_2025=[640349, 634800, 583272, 698077]

In [ ]:
tes_2010 = [291608, 327017, 437338, 432338, 430974, 431246, 509173, 404345, 393909, 488256, 372583, 391648]
tes_2011 = [347822, 382407, 407232, 500811, 381295, 424473, 520225, 395222, 393646, 451442, 340267, 389041]
tes_2012 = [305247, 339974, 406796, 477277, 411668, 466273, 504471, 474003, 408814, 465188, 353943, 398075]
tes_2013 = [309813, 340481, 455991, 466638, 451501, 466513, 495939, 543236, 444438, 500574, 391344, 456865]
tes_2014 = [354493, 395875, 471088, 553296, 480992, 456995,498176, 514785, 431151, 483134, 373381, 424087]  
tes_2015 = [329830, 369286, 451461, 521785, 466305, 385871,515054, 458999, 434775, 468856, 346872, 402610]  
tes_2016 = [316871, 349581, 441745, 497266, 437433, 339307,525377, 476089, 409430, 463026, 386305, 460774]  # Jan→Déc
tes_2017 = [358608, 403694, 476096, 586866, 469609, 412933,591781, 526142, 467511, 571957, 469137, 530583]  # Jan→Déc
tes_2018 = [431349, 481441, 625284, 632117, 471967, 520623,616908, 595579, 523395, 652600, 557185, 570653]  # Jan→Déc
tes_2019 = [479056, 518846, 598406, 689215, 475117, 600091,733880, 662760, 535809, 657350, 518103, 574847]  # Jan→Déc
tes_2021 = [50534, 32686, 36989, 14222, 21995, 100985,264761, 188453, 142806, 248642, 178544, 3718]  # Jan→Déc
tes_2022 = [2774, 120051, 241920, 343246, 436416, 520182,689139, 510183, 475089, 636775, 494013, 594992]  # Jan→Déc
tes_2023=[444408,541643,597667,654928,630077,598308, 752207, 616143, 500010, 651793,526626,636217]
tes_2024=[494208,642733,691026,754100,767212,683375,860187,829406,699434,871449,720467,784192]
tes_2025=[624848,761377,768739,966724]

In [ ]:
total_2024=[992541,1147999,1157507,1308658,1331234,1503732,2555368,1816622,1281101,1499115,1280138,1537934]
total_2025=[1265197,1396177,1352011,1664801,154004,1665206]

In [ ]:
tes_2025=[624848,761377,768739,966724]
tes_2025=[624848,761377,768739,966724]
total_2025=[1265197,1396177,1352011,1664801,154004,1665206]
resutls=[]
for i in range(6):
    if i<4:
        resutls.append({
            "date":f"0{i+1}/2025",
            "TES":tes_2025[i],
            "MRE":mre_2025[i],
            "Total Arrivées":total_2025[i]
        })
    else:
        resutls.append({
            "date":f"0{i+1}/2025",
            "TES":None,
            "MRE":None,
            "Total Arrivées":total_2025[i]
        })

In [ ]:
annees=[2010,2011,2012,2013,2014,2015,2016,2017,2018,2019,2021,2022,2023,2024]
annees.reverse()
tes_par_annee = {an: globals()[f"tes_{an}"] 
                 for an in annees 
                 if f"tes_{an}" in globals()}
mre_par_annee = {an: globals()[f"mre_{an}"] 
                 for an in annees 
                 if f"mre_{an}" in globals()}

for i in range(len(annees)):
    for j in range(12):
        mois=f"0{j+1}" if j<9 else f"{j+1}"
        resutls.append({
            "date":f"{mois}/{annees[i]}",
            "TES":tes_par_annee[annees[i]][j],
            "MRE":mre_par_annee[annees[i]][j],
            "Total Arrivées":tes_par_annee[annees[i]][j]+mre_par_annee[annees[i]][j]
        })

In [ ]:
df=pd.DataFrame(resutls)
df.to_csv("arrivee_touristiques.csv",index=False)

In [ ]:
# num_cols = ["TES", "MRE", "Total Arrivées"]

# def fmt(x):
#     return f"{x:,.0f}".replace(",", " ") if pd.notna(x) else ""

# df.style.format({c: fmt for c in num_cols})

Nuitées

In [ ]:
nuit_2022 = [301826, 682549, 1065782, 899267, 1684479, 1674531, 2184747, 2875411, 1974605, 2100140, 1810930, 1755566]
nuit_2021 = [408092, 406641, 499935, 270213, 433023, 703183, 1314571, 1588969, 1068654, 1007315, 933081, 559906]
nuit_2019 = [1593011, 1687793, 2175961, 2548282, 1473077, 2008799, 2503862, 3022911, 2241340, 2300918, 1948283, 1767518]
nuit_2018 = [1611117, 1612767, 2012722, 2322292, 1705875, 1606122, 2365739, 2893314, 2142246, 2217975, 1823050, 1718189]
nuit_2017 = [1341354, 1505708, 1764321, 2208685, 1791639, 1197187, 2188170, 2791049, 1965359, 2006106, 1764791, 1589931]
nuit_2016 = [1210602, 1259753, 1488837, 1747244, 1665178, 982206, 1907322, 2602529, 1716948, 1672041, 1560876, 1474222]
nuit_2015 = [1225147, 1261998, 1503012, 1780506, 1692343, 1202842, 1477294, 2477886, 1614269, 1649545, 1309674, 1229735]
nuit_2014 = [1333413, 1366815, 1646762, 1962531, 1807977, 1601789, 1270630, 2532476, 1804323, 1703179, 1353341, 1250239]
nuit_2013 = [1220383, 1184176, 1551862, 1749955, 1699540, 1674401, 1368256, 2328836, 1836892, 1695657, 1397315, 1406493]
nuit_2012 = [1073849, 1199252, 1306297, 1675203, 1470336, 1465909, 1702036, 1822884, 1722651, 1533702, 1303983, 1209277]
nuit_2011 = [1285171, 1287995, 1436477, 1696037, 1324788, 1294143, 1969759, 1315792, 1552365, 1503095, 1084808, 1116792]

In [ ]:
annees=[2011,2012,2013,2014,2015,2016,2017,2018,2019,2021,2022]
annees.reverse()

In [ ]:

nuit_par_annee = {an: globals()[f"nuit_{an}"] 
                 for an in annees 
                 if f"nuit_{an}" in globals()}


nuits=[]
for i in range(len(annees)):
    for j in range(12):
        mois=f"0{j+1}" if j<9 else f"{j+1}"
        nuits.append({
            "Date":f"{mois}/{annees[i]}",
            "Nuité":nuit_par_annee[annees[i]][j]
        })

taux d'accupation

In [ ]:
taux_2012=[32, 37 ,38, 46, 41, 41,42,42,46,41,38,34]
taux_2013=[35,38,43,48,46,46,35,54,50,44,41,39]
taux_2015=[34,39,41,47,45,33,35,55,42,43,37,33]
taux_2016=[32,35,39,44,42,26,43,55,42,41,42,36]

par catégorie

In [83]:
df=pd.read_excel("./data/nuite.xlsx")
df1=df[["Date","destination","Nuité"]]
df1

        Date destination   Nuité
0    01/2025   Marrakech  744674
1    01/2025      Agadir  479283
2    01/2025  Casablanca  178186
3    01/2025      Tanger  113442
4    01/2025         Fès   71684
..       ...         ...     ...
266  12/2023      Tanger  102398
267  12/2023         Fès   69878
268  12/2023       Rabat   64945
269  12/2023    Al Haouz   54659
270  12/2023   Essaouira   41127

[271 rows x 3 columns]

In [91]:
data1=pd.read_csv("./data/nuites_par_date_categorie_2014.csv")
data1=data1.drop(["date"],axis=1)
data1["mm_yy"]

0      01/14
1      01/14
2      01/14
3      01/14
4      01/14
       ...
151    12/14
152    12/14
153    12/14
154    12/14
155    12/14
Name: mm_yy, Length: 156, dtype: object

In [92]:
def change(text):
    text=str(text)
    if "14" in text:
        return text.replace("14","15")

In [93]:
data1["mm_yy"]=data1["mm_yy"].apply(change)
data1

     mm_yy            categorie  nuitees
0    01/15  Agadir-Ida-Outanane   321670
1    01/15               Autres    99090
2    01/15           Casablanca   130493
3    01/15    El Jadida-Mazagan    25040
4    01/15    Essaouira-Mogador    21965
..     ...                  ...      ...
151  12/15           Ouarzazate    21486
152  12/15         Oujda-Saïdia    13259
153  12/15                Rabat    49900
154  12/15               Tanger    55949
155  12/15              Tétouan    20928

[156 rows x 3 columns]

In [100]:
data2=pd.read_csv('./data/nuites_par_date_categorie_2012.csv')
data2=data2.drop(["date"],axis=1)
data2
data3=pd.read_csv('./data/nuites_par_date_categorie_2013.csv')
data3=data3.drop(["date"],axis=1)
data3
data4=pd.read_csv('./data/nuites_par_date_categorie_2016.csv')
data4=data4.drop(["date"],axis=1)
data4
data5=pd.read_csv('./data/nuites_par_date_categorie_2017.csv')
data5=data5.drop(["date"],axis=1)
data5
data6=pd.read_csv('./data/nuites_par_date_categorie_2018.csv')
data6=data6.drop(["date"],axis=1)
data6

     mm_yy          categorie  nuitees
0    01/18   Agadir-Taghazout   443587
1    01/18         Casablanca   166947
2    01/18  El Jadida-Mazagan    39960
3    01/18  Essaouira-Mogador    27349
4    01/18                Fès    70026
..     ...                ...      ...
151  12/18        Oujda-Angad    14194
152  12/18              Rabat    65826
153  12/18             Saïdia       68
154  12/18             Tanger    92096
155  12/18            Tétouan     8646

[156 rows x 3 columns]

In [136]:
full=pd.concat([data6,data5,data4,data1,data3,data2])
full=full.rename(columns={"mm_yy":"Date","categorie":"Destination","nuitees":"Nuité"})
full

      Date        Destination    Nuité
0    01/18   Agadir-Taghazout   443587
1    01/18         Casablanca   166947
2    01/18  El Jadida-Mazagan    39960
3    01/18  Essaouira-Mogador    27349
4    01/18                Fès    70026
..     ...                ...      ...
127  12/12         Ouarzazate    22483
128  12/12              Rabat    47796
129  12/12     TOTAL_National  1209277
130  12/12             Tanger    10630
131  12/12            Tétouan    15618

[924 rows x 3 columns]

In [137]:
def stander(text):
    text=str(text)
    x=text.split("/")[1]
    y=text.split("/")[0]
    return f"{y}/20{x}"

In [138]:
full["Date par mois"]=full["Date"].apply(stander)
full=full.drop(["Date"],axis=1)
full

           Destination    Nuité Date par mois
0     Agadir-Taghazout   443587       01/2018
1           Casablanca   166947       01/2018
2    El Jadida-Mazagan    39960       01/2018
3    Essaouira-Mogador    27349       01/2018
4                  Fès    70026       01/2018
..                 ...      ...           ...
127         Ouarzazate    22483       12/2012
128              Rabat    47796       12/2012
129     TOTAL_National  1209277       12/2012
130             Tanger    10630       12/2012
131            Tétouan    15618       12/2012

[924 rows x 3 columns]

In [140]:
full=full[["Date par mois","Destination","Nuité"]]
full=full.rename(columns={"Date par mois":"Date"})
full

        Date        Destination    Nuité
0    01/2018   Agadir-Taghazout   443587
1    01/2018         Casablanca   166947
2    01/2018  El Jadida-Mazagan    39960
3    01/2018  Essaouira-Mogador    27349
4    01/2018                Fès    70026
..       ...                ...      ...
127  12/2012         Ouarzazate    22483
128  12/2012              Rabat    47796
129  12/2012     TOTAL_National  1209277
130  12/2012             Tanger    10630
131  12/2012            Tétouan    15618

[924 rows x 3 columns]

In [106]:
df1=df1.rename(columns={"destination":"Destination"})
df1

        Date Destination   Nuité
0    01/2025   Marrakech  744674
1    01/2025      Agadir  479283
2    01/2025  Casablanca  178186
3    01/2025      Tanger  113442
4    01/2025         Fès   71684
..       ...         ...     ...
266  12/2023      Tanger  102398
267  12/2023         Fès   69878
268  12/2023       Rabat   64945
269  12/2023    Al Haouz   54659
270  12/2023   Essaouira   41127

[271 rows x 3 columns]